{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 140, 1], "input_dtype": "float32", "sparse": false, "name": "input_61"}, "inbound_nodes": [], "name": "input_61"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_65", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 28, 140, 1], "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["input_61", 0, 0]]], "name": "convolution2d_65"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_48", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_65", 0, 0]]], "name": "maxpooling2d_48"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_66", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 28, 28, 1], "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_48", 0, 0]]], "name": "convolution2d_66"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_49", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_66", 0, 0]]], "name": "maxpooling2d_49"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_23"}, "inbound_nodes": [[["maxpooling2d_49", 0, 0]]], "name": "flatten_23"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_201", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1320, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 50}, "inbound_nodes": [[["flatten_23", 0, 0]]], "name": "dense_201"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_202", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_201", 0, 0]]], "name": "dense_202"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_203", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_201", 0, 0]]], "name": "dense_203"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_204", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_201", 0, 0]]], "name": "dense_204"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_205", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_201", 0, 0]]], "name": "dense_205"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_206", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 11}, "inbound_nodes": [[["dense_201", 0, 0]]], "name": "dense_206"}], "input_layers": [["input_61", 0, 0]], "output_layers": [["dense_202", 0, 0], ["dense_203", 0, 0], ["dense_204", 0, 0], ["dense_205", 0, 0], ["dense_206", 0, 0]], "name": "model_26"}}